guides/cursor/baselines/gin_pprof_runs/k6_gin_20260618_010924.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_pprof.js
        output: -

     scenarios: (100.00%) 1 scenario, 48 max VUs, 1m5s max duration (incl. graceful stop):
              * steady: 48 looping VUs for 35s (gracefulStop: 30s)

time="2026-06-18T01:09:28+05:30" level=info msg="pprof load: 48 VUs × 35s, scenario=tagged_ecdsa" source=console

running (0m01.0s), 48/48 VUs, 915 complete and 0 interrupted iterations
steady   [   3% ] 48 VUs  01.0s/35s

running (0m02.0s), 48/48 VUs, 1728 complete and 0 interrupted iterations
steady   [   6% ] 48 VUs  02.0s/35s

running (0m03.0s), 48/48 VUs, 2926 complete and 0 interrupted iterations
steady   [   9% ] 48 VUs  03.0s/35s

running (0m04.0s), 48/48 VUs, 3923 complete and 0 interrupted iterations
steady   [  11% ] 48 VUs  04.0s/35s

running (0m05.0s), 48/48 VUs, 5057 complete and 0 interrupted iterations
steady   [  14% ] 48 VUs  05.0s/35s

running (0m06.0s), 48/48 VUs, 6256 complete and 0 interrupted iterations
steady   [  17% ] 48 VUs  06.0s/35s

running (0m07.0s), 48/48 VUs, 7489 complete and 0 interrupted iterations
steady   [  20% ] 48 VUs  07.0s/35s

running (0m08.0s), 48/48 VUs, 8451 complete and 0 interrupted iterations
steady   [  23% ] 48 VUs  08.0s/35s

running (0m09.0s), 48/48 VUs, 9476 complete and 0 interrupted iterations
steady   [  26% ] 48 VUs  09.0s/35s

running (0m10.0s), 48/48 VUs, 10966 complete and 0 interrupted iterations
steady   [  29% ] 48 VUs  10.0s/35s

running (0m11.0s), 48/48 VUs, 12137 complete and 0 interrupted iterations
steady   [  31% ] 48 VUs  11.0s/35s

running (0m12.0s), 48/48 VUs, 13232 complete and 0 interrupted iterations
steady   [  34% ] 48 VUs  12.0s/35s

running (0m13.0s), 48/48 VUs, 14810 complete and 0 interrupted iterations
steady   [  37% ] 48 VUs  13.0s/35s

running (0m14.0s), 48/48 VUs, 16326 complete and 0 interrupted iterations
steady   [  40% ] 48 VUs  14.0s/35s

running (0m15.0s), 48/48 VUs, 17775 complete and 0 interrupted iterations
steady   [  43% ] 48 VUs  15.0s/35s

running (0m16.0s), 48/48 VUs, 19222 complete and 0 interrupted iterations
steady   [  46% ] 48 VUs  16.0s/35s

running (0m17.0s), 48/48 VUs, 20264 complete and 0 interrupted iterations
steady   [  49% ] 48 VUs  17.0s/35s

running (0m18.0s), 48/48 VUs, 21535 complete and 0 interrupted iterations
steady   [  51% ] 48 VUs  18.0s/35s

running (0m19.0s), 48/48 VUs, 22844 complete and 0 interrupted iterations
steady   [  54% ] 48 VUs  19.0s/35s

running (0m20.0s), 48/48 VUs, 24192 complete and 0 interrupted iterations
steady   [  57% ] 48 VUs  20.0s/35s

running (0m21.0s), 48/48 VUs, 25677 complete and 0 interrupted iterations
steady   [  60% ] 48 VUs  21.0s/35s

running (0m22.0s), 48/48 VUs, 27132 complete and 0 interrupted iterations
steady   [  63% ] 48 VUs  22.0s/35s

running (0m23.0s), 48/48 VUs, 28426 complete and 0 interrupted iterations
steady   [  66% ] 48 VUs  23.0s/35s

running (0m24.0s), 48/48 VUs, 29701 complete and 0 interrupted iterations
steady   [  69% ] 48 VUs  24.0s/35s

running (0m25.0s), 48/48 VUs, 31194 complete and 0 interrupted iterations
steady   [  71% ] 48 VUs  25.0s/35s

running (0m26.0s), 48/48 VUs, 32407 complete and 0 interrupted iterations
steady   [  74% ] 48 VUs  26.0s/35s

running (0m27.0s), 48/48 VUs, 33857 complete and 0 interrupted iterations
steady   [  77% ] 48 VUs  27.0s/35s

running (0m28.0s), 48/48 VUs, 35352 complete and 0 interrupted iterations
steady   [  80% ] 48 VUs  28.0s/35s

running (0m29.0s), 48/48 VUs, 36924 complete and 0 interrupted iterations
steady   [  83% ] 48 VUs  29.0s/35s

running (0m30.0s), 48/48 VUs, 38211 complete and 0 interrupted iterations
steady   [  86% ] 48 VUs  30.0s/35s

running (0m31.0s), 48/48 VUs, 39302 complete and 0 interrupted iterations
steady   [  89% ] 48 VUs  31.0s/35s

running (0m32.0s), 48/48 VUs, 40419 complete and 0 interrupted iterations
steady   [  91% ] 48 VUs  32.0s/35s

running (0m33.0s), 48/48 VUs, 41709 complete and 0 interrupted iterations
steady   [  94% ] 48 VUs  33.0s/35s

running (0m34.0s), 48/48 VUs, 43114 complete and 0 interrupted iterations
steady   [  97% ] 48 VUs  34.0s/35s

running (0m35.0s), 48/48 VUs, 44450 complete and 0 interrupted iterations
steady   [ 100% ] 48 VUs  35.0s/35s
time="2026-06-18T01:10:04+05:30" level=info msg="pprof load done (started 2026-06-17T19:39:28.795Z)" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(99)<5000' p(99)=547.61ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 89004   2522.00955/s
    checks_succeeded...: 100.00% 89004 out of 89004
    checks_failed......: 0.00%   0 out of 89004

    ✓ status is 200
    ✓ response has content

    CUSTOM
    active_latency.................: avg=9.316969   min=2        med=6      max=162      p(90)=18      p(95)=24.9     p(99)=46      
    errors.........................: 0.00%  0 out of 44502
    hft_latency....................: avg=499.217687 min=137      med=498    max=1026     p(90)=691     p(95)=741.8    p(99)=866.48  
    pdf_generation_time............: avg=30.781897  min=1        med=4      max=1026     p(90)=18      p(95)=108.95   p(99)=620     
    retail_latency.................: avg=5.797263   min=1        med=3      max=447      p(90)=12      p(95)=18       p(99)=35      

    HTTP
    http_req_duration..............: avg=26.24ms    min=418.23µs med=3.39ms max=986.98ms p(90)=16.84ms p(95)=89.86ms  p(99)=547.61ms
      { expected_response:true }...: avg=26.24ms    min=418.23µs med=3.39ms max=986.98ms p(90)=16.84ms p(95)=89.86ms  p(99)=547.61ms
    http_req_failed................: 0.00%  0 out of 44503
    http_reqs......................: 44503  1261.033111/s

    EXECUTION
    iteration_duration.............: avg=37.9ms     min=1.45ms   med=5.7ms  max=1.29s    p(90)=22.21ms p(95)=132.56ms p(99)=727.62ms
    iterations.....................: 44502  1261.004775/s
    vus............................: 48     min=48         max=48
    vus_max........................: 48     min=48         max=48

    NETWORK
    data_received..................: 4.3 GB 120 MB/s
    data_sent......................: 2.9 GB 83 MB/s



running (0m35.3s), 00/48 VUs, 44502 complete and 0 interrupted iterations
steady ✓ [ 100% ] 48 VUs  35s