guides/cursor/baselines/gin_pprof_runs/k6_gin_20260618_011005.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_pprof.js
        output: -

     scenarios: (100.00%) 1 scenario, 48 max VUs, 1m5s max duration (incl. graceful stop):
              * steady: 48 looping VUs for 35s (gracefulStop: 30s)

time="2026-06-18T01:10:09+05:30" level=info msg="pprof load: 48 VUs × 35s, scenario=tagged_ecdsa" source=console

running (0m01.0s), 48/48 VUs, 966 complete and 0 interrupted iterations
steady   [   3% ] 48 VUs  01.0s/35s

running (0m02.0s), 48/48 VUs, 2381 complete and 0 interrupted iterations
steady   [   6% ] 48 VUs  02.0s/35s

running (0m03.0s), 48/48 VUs, 3739 complete and 0 interrupted iterations
steady   [   9% ] 48 VUs  03.0s/35s

running (0m04.0s), 48/48 VUs, 5036 complete and 0 interrupted iterations
steady   [  11% ] 48 VUs  04.0s/35s

running (0m05.0s), 48/48 VUs, 6613 complete and 0 interrupted iterations
steady   [  14% ] 48 VUs  05.0s/35s

running (0m06.0s), 48/48 VUs, 7979 complete and 0 interrupted iterations
steady   [  17% ] 48 VUs  06.0s/35s

running (0m07.0s), 48/48 VUs, 9663 complete and 0 interrupted iterations
steady   [  20% ] 48 VUs  07.0s/35s

running (0m08.0s), 48/48 VUs, 11105 complete and 0 interrupted iterations
steady   [  23% ] 48 VUs  08.0s/35s

running (0m09.0s), 48/48 VUs, 12747 complete and 0 interrupted iterations
steady   [  26% ] 48 VUs  09.0s/35s

running (0m10.0s), 48/48 VUs, 14227 complete and 0 interrupted iterations
steady   [  29% ] 48 VUs  10.0s/35s

running (0m11.0s), 48/48 VUs, 15626 complete and 0 interrupted iterations
steady   [  31% ] 48 VUs  11.0s/35s

running (0m12.0s), 48/48 VUs, 16765 complete and 0 interrupted iterations
steady   [  34% ] 48 VUs  12.0s/35s

running (0m13.0s), 48/48 VUs, 18145 complete and 0 interrupted iterations
steady   [  37% ] 48 VUs  13.0s/35s

running (0m14.0s), 48/48 VUs, 19716 complete and 0 interrupted iterations
steady   [  40% ] 48 VUs  14.0s/35s

running (0m15.0s), 48/48 VUs, 21070 complete and 0 interrupted iterations
steady   [  43% ] 48 VUs  15.0s/35s

running (0m16.0s), 48/48 VUs, 22434 complete and 0 interrupted iterations
steady   [  46% ] 48 VUs  16.0s/35s

running (0m17.0s), 48/48 VUs, 23934 complete and 0 interrupted iterations
steady   [  49% ] 48 VUs  17.0s/35s

running (0m18.0s), 48/48 VUs, 25089 complete and 0 interrupted iterations
steady   [  51% ] 48 VUs  18.0s/35s

running (0m19.0s), 48/48 VUs, 26221 complete and 0 interrupted iterations
steady   [  54% ] 48 VUs  19.0s/35s

running (0m20.0s), 48/48 VUs, 27587 complete and 0 interrupted iterations
steady   [  57% ] 48 VUs  20.0s/35s

running (0m21.0s), 48/48 VUs, 29143 complete and 0 interrupted iterations
steady   [  60% ] 48 VUs  21.0s/35s

running (0m22.0s), 48/48 VUs, 30612 complete and 0 interrupted iterations
steady   [  63% ] 48 VUs  22.0s/35s

running (0m23.0s), 48/48 VUs, 31914 complete and 0 interrupted iterations
steady   [  66% ] 48 VUs  23.0s/35s

running (0m24.0s), 48/48 VUs, 33136 complete and 0 interrupted iterations
steady   [  69% ] 48 VUs  24.0s/35s

running (0m25.0s), 48/48 VUs, 34410 complete and 0 interrupted iterations
steady   [  71% ] 48 VUs  25.0s/35s

running (0m26.0s), 48/48 VUs, 35726 complete and 0 interrupted iterations
steady   [  74% ] 48 VUs  26.0s/35s

running (0m27.0s), 48/48 VUs, 36714 complete and 0 interrupted iterations
steady   [  77% ] 48 VUs  27.0s/35s

running (0m28.0s), 48/48 VUs, 37959 complete and 0 interrupted iterations
steady   [  80% ] 48 VUs  28.0s/35s

running (0m29.0s), 48/48 VUs, 39356 complete and 0 interrupted iterations
steady   [  83% ] 48 VUs  29.0s/35s

running (0m30.0s), 48/48 VUs, 40658 complete and 0 interrupted iterations
steady   [  86% ] 48 VUs  30.0s/35s

running (0m31.0s), 48/48 VUs, 42019 complete and 0 interrupted iterations
steady   [  89% ] 48 VUs  31.0s/35s

running (0m32.0s), 48/48 VUs, 43285 complete and 0 interrupted iterations
steady   [  91% ] 48 VUs  32.0s/35s

running (0m33.0s), 48/48 VUs, 44765 complete and 0 interrupted iterations
steady   [  94% ] 48 VUs  33.0s/35s

running (0m34.0s), 48/48 VUs, 45822 complete and 0 interrupted iterations
steady   [  97% ] 48 VUs  34.0s/35s

running (0m35.0s), 48/48 VUs, 46935 complete and 0 interrupted iterations
steady   [ 100% ] 48 VUs  35.0s/35s
time="2026-06-18T01:10:45+05:30" level=info msg="pprof load done (started 2026-06-17T19:40:09.794Z)" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(99)<5000' p(99)=520.16ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 94060   2665.018043/s
    checks_succeeded...: 100.00% 94060 out of 94060
    checks_failed......: 0.00%   0 out of 94060

    ✓ status is 200
    ✓ response has content

    CUSTOM
    active_latency.................: avg=8.747814   min=1        med=6      max=163      p(90)=17      p(95)=22       p(99)=41.26   
    errors.........................: 0.00%  0 out of 47030
    hft_latency....................: avg=472.296848 min=142      med=474    max=1043     p(90)=643.3   p(95)=697      p(99)=796.53  
    pdf_generation_time............: avg=29.185456  min=0        med=4      max=1043     p(90)=17      p(95)=137.75   p(99)=587     
    retail_latency.................: avg=5.373618   min=0        med=3      max=193      p(90)=11      p(95)=16       p(99)=31      

    HTTP
    http_req_duration..............: avg=24.84ms    min=399.48µs med=3.21ms max=822.91ms p(90)=15.41ms p(95)=83.22ms  p(99)=520.16ms
      { expected_response:true }...: avg=24.84ms    min=399.48µs med=3.21ms max=822.91ms p(90)=15.41ms p(95)=83.22ms  p(99)=520.16ms
    http_req_failed................: 0.00%  0 out of 47031
    http_reqs......................: 47031  1332.537355/s

    EXECUTION
    iteration_duration.............: avg=35.84ms    min=1.39ms   med=5.42ms max=1.36s    p(90)=20.5ms  p(95)=192.22ms p(99)=687.16ms
    iterations.....................: 47030  1332.509021/s
    vus............................: 48     min=48         max=48
    vus_max........................: 48     min=48         max=48

    NETWORK
    data_received..................: 4.5 GB 127 MB/s
    data_sent......................: 3.1 GB 88 MB/s



running (0m35.3s), 00/48 VUs, 47030 complete and 0 interrupted iterations
steady ✓ [ 100% ] 48 VUs  35s